[
  {
    "id": "intro",
    "label": "Введение",
    "title": "",
    "icon": "Shield",
    "content": "<p>Добро пожаловать в Royolands!</p><p>Сервисы Royolands предоставляются <span class=\"font-bold text-[var(--fg)]\">самозанятым Воеводиным Никитой Александровичем</span> («мы», «наш» или «нас»). Мы публикуем и распространяем наши услуги по всему миру. Мы признаем и ценим конфиденциальность людей («вы» или «пользователь»), которые используют наши услуги. Настоящая Политика конфиденциальности описывает различные способы, которыми мы можем собирать, использовать и передавать информацию в наших услугах, через них или в связи с ними.</p><p>Используя наши веб-сайты или иным образом пользуясь нашими услугами, вы подтверждаете, что прочитали, поняли и приняли настоящую Политику конфиденциальности. В случае несогласия с какими-либо условиями настоящей Политики конфиденциальности, вы можете немедленно прекратить использование наших услуг.</p><div class=\"p-4 rounded-xl bg-indigo-500/10 border border-indigo-500/20 text-sm font-medium mt-4\">Примечание: Мы можем переводить эту Политику на другие языки. В случае расхождений между английской версией и другими языками, английская версия имеет преимущественную силу, с учетом применимого законодательства.</div>"
  },
  {
    "id": "collect",
    "label": "1. Сбор данных",
    "title": "1. Какие данные мы собираем",
    "icon": "Database",
    "content": "<p>Персональные данные означают любую информацию, относящуюся к идентифицированному или идентифицируемому физическому лицу.</p><h4 class=\"font-bold text-[var(--fg)] mt-6 mb-2\">A. Данные, которые мы собираем и обрабатываем (напрямую или через третьих лиц):</h4><ul class=\"list-disc pl-5 space-y-2\"><li><strong>Информация об учетной записи:</strong> Имя пользователя, адрес электронной почты, пароль, UID, никнейм.</li><li><strong>Игровые данные:</strong> Статус игрового процесса, прогресс, статистика использования.</li><li><strong>Социальные сети:</strong> Если вы входите через соцсети (Google, Discord), мы получаем информацию вашего профиля.</li><li><strong>Платежные данные:</strong> История покупок, дата транзакции, сумма, способ оплаты (мы не храним полные номера карт).</li><li><strong>Данные об устройстве:</strong> IP-адрес, тип платформы (PC/Mobile), модель устройства.</li><li><strong>Данные чата:</strong> Если вы используете функции чата, предоставляемые в некоторых сервисах (например, внутриигровой чат), мы можем обрабатывать записи коммуникаций и применять технологии шифрования в определённых сервисах - в некоторых сервисах используется сквозное шифрование для защиты ваших данных.</li><li><strong>Информация форума сообщества:</strong> Мы будем собирать контент, сообщения и другую информацию, которую вы предоставляете при использовании сервиса форума сообщества, размещенного на наших серверах или на сторонних платформах (таких как Discord). В том числе это контент, который вы создаёте или которым делитесь, и/или контент, которым вы обмениваетесь с другими, включая информацию, содержащуюся в предоставленном вами контенте или связанную с ним (например, метаданные), такую как дата создания файла. Это также включает контент, который вы просматриваете или используете через предоставляемые нами функции (например, функцию фотосъёмки, загрузки фотографий и загрузки контента). Собираемая информация может включать выбранные вами теги интересов и предпочитаемый язык.</li><li><strong>Пользовательский контент:</strong> Мы обрабатываем весь контент, созданный пользователями, включая информацию, которую вы публикуете в наших сервисах, все отзывы, которые вы нам предоставляете, а также информацию, которую вы публикуете, комментируете или отмечаете в любом из наших материалов или сервисов.</li></ul><h4 class=\"font-bold text-[var(--fg)] mt-6 mb-2\">B. Данные, собираемые автоматически:</h4><ul class=\"list-disc pl-5 space-y-2\"><li><strong>Данные, связанные с устройством:</strong> Такие данные включают онлайн ID, рекламный ID и/или ID устройства, название/модель устройства, MAC-адрес, тип браузера, IP-адрес, данные IMEI, данные CPU, версию операционной системы и язык, часовой пояс, DPI экрана, разрешение, режим/состояние устройства, настройки конфигурации устройства и браузера, данные памяти, модель видеокарты и т. д.</li><li><strong>Файлы cookie и аналогичные технологии.</strong></li><li><strong>Отчеты об ошибках и сбоях (Crash reports).</strong></li><li><strong>Данные, связанные с безопасностью.</strong> Такие данные включают названия установленных приложений, время загрузки системы, время установки и обновления приложений, запрашиваемые и рекомендуемые URL-адреса, подробную информацию о системной активности, информацию об игровых модификациях и времени работы, состояние и информацию о сети, а также данные, связанные с внешними модификациями.</li><li><strong>Данные о взаимодействии с сервисами и/или их использовании</strong> Такие данные включают просмотренные вами страницы и другой контент, URL-адреса сайтов, с которых вы перешли на наш сайт, любой опубликованный вами контент, даты и время ваших посещений, типы контента, который вы ищете, просматриваете или с которым взаимодействуете, используемые функции, предпринятые действия, люди или аккаунты, с которыми вы взаимодействуете, а также когда, как часто и как долго это происходит.</li><li><strong>Информация о вашем взаимодействии с другими пользователями</strong> Мы также собираем и используем контент, сообщения и информацию, которые вы предоставляете при взаимодействии с другими людьми в качестве подписчика или контакта.</li><li><strong>Данные, которые передают нам третьи лица.</strong> Такие данные включают: (i) данные, полученные от сторонних приложений, когда вы подключаете их к нашим сервисам, например, при входе в учётную запись через сторонний аккаунт Facebook, X, Google или Apple; и (ii) данные третьих сторон, используемые для push-уведомлений, обеспечения безопасности и статистического анализа.</li><li><strong>Обратите внимание:</strong> В определённых обстоятельствах мы можем собирать персональные данные, не указанные в данных условиях, на основании вашего согласия или иных правовых оснований. В таких случаях мы предоставим подробную информацию об изменениях в способах или целях сбора или обработки данных (если они отличаются или не указаны явно в настоящей Политике конфиденциальности) в соответствии с требованиями применимого законодательства.</li><li>Когда вы используете сторонние сервисы (например, виджеты социальных сетей, кнопки обмена или механизмы входа третьих сторон) или взаимодействуете с ними в связи с нашими сервисами, <strong>настоящая Политика конфиденциальности не распространяется на такие сервисы/функции, которые регулируются соответствующими политиками конфиденциальности третьих сторон.</strong></li></ul>"
  },
  {
    "id": "purpose",
    "label": "2. Цели использования",
    "title": "2. Зачем мы собираем данные",
    "icon": "Eye",
    "content": "<p>Мы собираем и обрабатываем ваши данные для следующих целей:</p><ul class=\"grid grid-cols-1 md:grid-cols-2 gap-4 mt-4 list-disc pl-5\"><li>Обеспечение доступа к играм и сервисам Royolands.</li><li>Управление учетной записью и профилем.</li><li>Проверка возраста и соблюдение законодательства.</li><li>Обеспечение безопасности, защита от мошенничества и читов.</li><li>Техническая поддержка и исправление ошибок.</li><li>Персонализация рекламы и маркетинговых предложений.</li><li>Аналитика для улучшения качества услуг.</li></ul>"
  },
  {
    "id": "legal",
    "label": "3. Правовая основа",
    "title": "3. Правовая основа обработки",
    "icon": "FileText",
    "content": "<p>Мы полагаемся на следующие правовые основания для обработки ваших данных:</p><ol class=\"list-decimal pl-5 space-y-3\"><li><strong>Исполнение договора:</strong> Необходимо для предоставления вам услуг (Terms of Service).</li><li><strong>Согласие:</strong> В случаях, требуемых законом (вы можете отозвать его в любой момент).</li><li><strong>Законные обязательства:</strong> Для соблюдения требований законодательства (налогового, уголовного).</li><li><strong>Законные интересы:</strong> Защита наших прав, предотвращение мошенничества, улучшение сервисов.</li></ol>"
  },
  {
    "id": "ads",
    "label": "4. Реклама",
    "title": "4. Реклама и ваш выбор",
    "icon": "Bell",
    "content": "<p>Для предоставления персонализированной рекламы вы соглашаетесь, что мы можем использовать ваши данные для таргетинга и анализа эффективности маркетинга.</p><p>Вы можете отказаться от получения маркетинговых коммуникаций, следуя инструкциям в письмах («отписаться») или изменив настройки уведомлений на устройстве.</p>"
  },
  {
    "id": "cookies",
    "label": "5. Cookies",
    "title": "5. Cookies и технологии отслеживания",
    "icon": "Cookie",
    "content": "<p>Мы используем файлы cookie и аналогичные технологии для улучшения функциональности сайта, анализа трафика и персонализации контента.</p><p>Вы можете отключить файлы cookie в настройках вашего браузера, однако это может повлиять на работу некоторых функций наших сервисов.</p><p>Мы или наши уполномоченные подрядчики также можем использовать файлы cookie и аналогичные технологии для предоставления и персонализации сервисов, предотвращения мошенничества и выполнения других вышеуказанных целей. Нашу политику в отношении файлов cookie можно найти по адресу https://www.royolands.com/en-us/legal/cookies. Обратите внимание, что вы можете отключить файлы cookie в настройках браузера или, в зависимости от вашей юрисдикции, через наши настройки файлов cookie, однако если вы это сделаете, некоторые части наших сервисов могут работать некорректно.</p>"
  },
  {
    "id": "sharing",
    "label": "6. Передача данных",
    "title": "6. Передача информации",
    "icon": "Users",
    "content": "<p>Мы можем передавать вашу информацию третьим лицам в следующих случаях:</p><ul class=\"list-disc pl-5 space-y-2 mt-4\"><li><strong>Другим пользователям:</strong> Другие пользователи могут следить за вашей игровой активностью в процессе игры. Другие пользователи также могут видеть отображаемые вами данные (включая ваш ник, UID, достижения, уровень и другую информацию о персонаже) и читать сообщения, которые вы публикуете через наши сервисы. Вы признаёте и соглашаетесь с тем, что наши сервисы также могут включать в себя доски объявлений, сообщества, форумы и/или другие зоны общения, где пользователи могут обмениваться идеями или общаться друг с другом, и любые данные, которые вы публикуете в любой зоне общения, являются общедоступными. Мы настоятельно рекомендуем всем пользователям никогда не публиковать личные или конфиденциальные данные на наших сервисах или через наши сервисы..</li><li><strong>Поставщикам услуг:</strong> Платежным системам, хостинг-провайдерам, сервисам поддержки клиентов.</li><li><strong>Компетентным органам:</strong> В соответствии с требованиями применимого законодательства или в целях общественных интересов мы можем предоставить определённую часть ваших персональных данных государственным органам.</li><p>За исключением случаев, предусмотренных применимым законодательством, мы оставляем за собой право раскрывать ваши персональные данные, если мы добросовестно полагаем, что такое раскрытие необходимо для идентификации, установления контакта или принятия правовых мер в отношении вас, если у нас есть основания полагать, что: (a) вы нарушили какое-либо другое соглашение между вами и нами, например, Условия обслуживания, настоящую Политику конфиденциальности, или иным образом причинили нам ущерб; (b) вы нарушили права и интересы третьих лиц (включая, но не ограничиваясь правами интеллектуальной собственности); и/или (c) это необходимо для предотвращения мошенничества или другой незаконной деятельности.</p><li><strong>При реорганизации:</strong> В случае слияния или продажи бизнеса данные могут быть переданы правопреемнику.</li><li><strong>Поставщики услуг:</strong> Мы можем сотрудничать со следующими типами сторонних поставщиков услуг, чтобы помочь нам предоставлять вам услуги и функции:<br/><br/>i. порталы социальных сетей (которые в некоторых странах могут считаться нашими партнёрами), предоставляющие услуги входа в систему и/или обмена контентом с нашими сервисами;<br/>ii. поставщики логистических услуг, предоставляющие транспортные услуги, например, для доставки физических призов пользователям;<br/>iii. операторы услуг SMS-рассылки и информационных сообщений;<br/>iv. поставщики платёжных услуг, которые предоставляют платёжные услуги, например, помогают нам в работе сервиса, обеспечивают удобство оплаты для пользователей и ведут историю транзакций;<br/>v. рекламные подрядчики, предоставляющие маркетинговые и рекламные кампании, включая показ рекламы, которая может быть вам интересна, проведение кампаний, отслеживание успешности и анализ их эффективности; а также<br/>vi. другие подрядчики (если таковые имеются), цель которых - предоставление вам наших сервисов.<br/><br/>Кроме того, такие поставщики услуг также могут использовать файлы cookie, веб-маяки и/или другие технологии отслеживания для сбора или получения данных о вас. Например, от пользователей, приобретающих продукты или услуги и/или оформляющих подписку на них, потребуется предоставить дополнительные данные сторонним поставщикам платёжных услуг, такие как действительный номер кредитной карты и срок её действия. Такие сторонние поставщики платёжных услуг могут собирать, обрабатывать и хранить ваши данные для обработки платежей и разрешения последующих платёжных споров и запросов. Мы также можем получать, обрабатывать и хранить информацию, предоставленную вами и/или такими сторонними платёжными сервисами, для подтверждения платежей, ведения истории покупок и/или защиты наших законных интересов при разрешении последующих платёжных споров и запросов.</li><p><strong>Несмотря на вышеизложенное, для некоторых наших сервисов, если вы совершаете какие-либо платежи при использовании этих сервисов, ваши платёжные данные будут полностью обрабатываться соответствующим поставщиком платёжных услуг, и мы не получаем и/или не обрабатываем ваши фактические платёжные данные, такие как номер карты или код безопасности. В этих случаях мы храним только данные о дате транзакции, валюте, стоимости и приобретенных продуктах.</strong></p></ul>"
  },
  {
    "id": "retention",
    "label": "7. Хранение данных",
    "title": "7. Хранение данных",
    "icon": "Server",
    "content": "<p>Мы храним ваши данные до тех пор, пока ваша учетная запись активна, или пока это необходимо для предоставления услуг.</p><p>Серверы Royolands могут располагаться в разных странах, включая <span class=\"font-semibold text-[var(--fg)]\">Российскую Федерацию, Европейский Союз и США</span>. Мы принимаем меры для обеспечения защиты данных при их трансграничной передаче.</p><p>Вы подтверждаете и соглашаетесь с тем, что ваши данные будут собираться и обрабатываться на наших серверах, которые могут находиться за пределами страны вашего проживания, и к этим данным будет иметь доступ наша глобальная служба поддержки, инженерный персонал и/или аффилированные компании. Независимо от местонахождения наших серверов, мы прилагаем все усилия для принятия надлежащих мер защиты, чтобы обеспечить соблюдение ваших прав в соответствии с настоящей Политикой конфиденциальности и применимыми законами и нормативными актами.</p><p>Если вы запрашиваете удаление или уничтожение ваших персональных данных, обратите внимание, что мы продолжим хранить ваши данные в той мере, в которой это требуется применимым законодательством, например, для соблюдения наших юридических обязательств, разрешения споров и/или исполнения соглашений между вами и нами. Обратите внимание, что удаление любых ваших данных может привести к прекращению предоставления некоторых наших применимых сервисов.</p><p>В случаях, предусмотренных законодательством, мы храним вашу информацию только в течение времени, необходимого для достижения целей сбора и обработки информации, или в течение более длительного срока хранения, установленного применимыми законами и нормативными актами. По истечении этого срока ваши персональные данные будут удалены, заблокированы или анонимизированы в соответствии с требованиями применимого законодательства.</p>"
  },
  {
    "id": "rights",
    "label": "8. Ваши права",
    "title": "8. Ваши права",
    "icon": "UserCheck",
    "content": "<p>В зависимости от вашего местоположения, вы можете иметь следующие права:</p><ul class=\"grid grid-cols-1 md:grid-cols-2 gap-4 mt-4 list-disc pl-5\"><li>Право на доступ к своим данным.</li><li>Право на исправление неточных данных.</li><li>Право на удаление данных («право на забвение»).</li><li>Право на ограничение обработки.</li><li>Право на переносимость данных.</li><li>Право отозвать согласие.</li></ul><p class=\"mt-4\">Для реализации этих прав свяжитесь с нами по адресу <a href=\"mailto:privacy@royolands.com\" class=\"text-indigo-500 font-bold underline\">privacy@royolands.com</a>.</p>"
  },
  {
    "id": "security",
    "label": "9. Безопасность",
    "title": "9. Безопасность данных",
    "icon": "Lock",
    "content": "<p>Мы принимаем разумные организационные и технические меры для защиты ваших данных от несанкционированного доступа. Однако передача данных через интернет никогда не бывает полностью безопасной. Мы рекомендуем использовать сложные пароли и не передавать данные учетной записи третьим лицам.</p><p><strong>Обратите внимание, что рекламодатели или веб-сайты, которые связаны с нашими сайтами и/или на которые ведут ссылки с наших сайтов, могут собирать ваши личные данные. Настоящая Политика конфиденциальности не распространяется на такие сторонние сервисы, и мы не можем контролировать их деятельность. Мы настоятельно рекомендуем вам ознакомиться с политикой конфиденциальности таких сторонних веб-сайтов, прежде чем предоставлять какие-либо личные данные.</strong></p>"
  },
  {
    "id": "children",
    "label": "10. Защита детей",
    "title": "10. Защита детей",
    "icon": "Smartphone",
    "content": "<p>Наши услуги не предназначены для детей младше 13 лет (или иного возраста согласия в вашей юрисдикции). Мы сознательно не собираем данные детей без согласия родителей.</p><p>Если вы родитель или опекун и узнали, что ваш ребенок предоставил нам данные без вашего согласия, пожалуйста, свяжитесь с нами, и мы удалим эту информацию. В некоторых регионах мы можем использовать «возрастной шлюз» (Age-Gate) для ограничения доступа.</p>"
  },
  {
    "id": "changes",
    "label": "11. Изменения",
    "title": "11. Изменения в Политике",
    "icon": "Globe",
    "content": "<p>Мы можем время от времени обновлять настоящую Политику конфиденциальности. Мы рекомендуем периодически проверять эту страницу. Если у вас есть какие-либо вопросы или сомнения относительно нашей политики конфиденциальности, пожалуйста, свяжитесь с нами, используя контактные данные, указанные в разделе «Связаться с нами». Продолжение использования сервисов после внесения изменений означает ваше согласие с новой редакцией.</p>"
  },
  {
    "id": "contact",
    "label": "12. Контакты",
    "title": "12. Контакты",
    "icon": "Mail",
    "content": "<div class=\"bg-[var(--card-bg)] border border-[var(--card-border)] rounded-3xl p-8\"><p class=\"mb-4\">Если у вас есть вопросы, жалобы или запросы касательно обработки ваших данных, свяжитесь с нашим ответственным за защиту данных:</p><div class=\"space-y-2\"><p><strong>Email:</strong> <a href=\"mailto:privacy@royolands.com\" class=\"text-indigo-500 hover:underline\">privacy@royolands.com</a></p><p><strong>Юридическое лицо:</strong> Самозанятый Воеводин Никита Александрович</p><p><strong>Адрес:</strong> Российская Федерация (полный адрес предоставляется по запросу)</p></div></div>"
  },
  {
    "id": "supplemental",
    "label": "13. Дополнительно",
    "title": "13. Дополнительные условия (по юрисдикциям)",
    "icon": "Globe",
    "content": "<p><strong>(1) Для резидентов РФ:</strong> Обработка данных регулируется Федеральным законом № 152-ФЗ «О персональных данных».</p><p><strong>(2) Для резидентов ЕЭЗ и Великобритании:</strong> Вы имеете права, предусмотренные GDPR, включая право подать жалобу в надзорный орган.</p><p><strong>(3) Для резидентов США (Калифорния):</strong> Согласно CCPA, вы имеете право знать, какие категории данных мы собираем, и требовать отказа от их «продажи» (мы не продаем ваши личные данные в традиционном смысле).</p><p class=\"mt-4 text-sm text-[var(--fg-muted)]\">Полный текст дополнительных условий доступен по запросу или в полной английской версии документа.</p>"
  }
]
